It happens all the time: someone gives you data containing malformed strings,
Python, lists and missing data. How do you tidy it up so you can get on with the
analysis?
Take this monstrosity as the DataFrame to use in the following puzzles:      
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],            
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],        
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],      
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )','12. Air France', '"Swiss Air"']})


Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays.

In [128]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
                  'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
                  'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                  'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
                  '12. Air France', '"Swiss Air"']})
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in these missing numbers and make the column an integer column (instead of a float column).

In [129]:
for i in range(len(df['FlightNumber'])):
  if pd.isnull(df['FlightNumber'][i]):
    df['FlightNumber'][i]=df['FlightNumber'][i-1] + 10
df

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

The From_To column would be better as two separate columns! Split each string on the underscore delimiter _ to give a new temporary DataFrame with the correct values. Assign the correct column names to this temporary DataFrame.

In [130]:
# for i in range(len(df['From'])):
dfcpy=df.copy()
dfcpy[['From','To']] =(df['From_To'].str.split('_',expand=True))

In [131]:
dfcpy

            From_To  FlightNumber  ...      From         To
0      LoNDon_paris       10045.0  ...    LoNDon      paris
1      MAdrid_miLAN       10055.0  ...    MAdrid      miLAN
2  londON_StockhOlm       10065.0  ...    londON  StockhOlm
3    Budapest_PaRis       10075.0  ...  Budapest      PaRis
4   Brussels_londOn       10085.0  ...  Brussels     londOn

[5 rows x 6 columns]

Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)

In [132]:
dfcpy['From']=dfcpy['From'].str.capitalize()
dfcpy['To']=dfcpy['To'].str.capitalize()

In [133]:
dfcpy

            From_To  FlightNumber  ...      From         To
0      LoNDon_paris       10045.0  ...    London      Paris
1      MAdrid_miLAN       10055.0  ...    Madrid      Milan
2  londON_StockhOlm       10065.0  ...    London  Stockholm
3    Budapest_PaRis       10075.0  ...  Budapest      Paris
4   Brussels_londOn       10085.0  ...  Brussels     London

[5 rows x 6 columns]

Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.

In [134]:
dfcpy=dfcpy.drop(columns='From_To')
dfcpy

   FlightNumber  RecentDelays              Airline      From         To
0       10045.0      [23, 47]               KLM(!)    London      Paris
1       10055.0            []    <Air France> (12)    Madrid      Milan
2       10065.0  [24, 43, 87]  (British Airways. )    London  Stockholm
3       10075.0          [13]       12. Air France  Budapest      Paris
4       10085.0      [67, 32]          "Swiss Air"  Brussels     London

 In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value should be NaN.

In [135]:
dfcpy['RecentDelays'].unique

<bound method Series.unique of 0        [23, 47]
1              []
2    [24, 43, 87]
3            [13]
4        [67, 32]
Name: RecentDelays, dtype: object>

In [136]:
# RD=[[]]
# def splt(n,arr):
#   RD.append([arr])

# for i in range(len(df)):
#   splt(df['RecentDelays'][i].split())
# RD=pd.DataFrame(df['RecentDelays'].values.tolist())
RD=0
RD=list(df['RecentDelays'])
# RD

In [137]:
for i in range(5):
  for j in range(3-len(RD[i])):
    RD[i].append('Nan')
RD

[[23, 47, 'Nan'],
 ['Nan', 'Nan', 'Nan'],
 [24, 43, 87],
 [13, 'Nan', 'Nan'],
 [67, 32, 'Nan']]

In [138]:
# for i in range(len(df)):
dfcpy[['Delay1','Delay2','Delay3']]=RD

In [139]:
dfcpy.drop(columns='RecentDelays',inplace=True)
dfcpy

   FlightNumber              Airline      From         To Delay1 Delay2 Delay3
0       10045.0               KLM(!)    London      Paris     23     47    Nan
1       10055.0    <Air France> (12)    Madrid      Milan    Nan    Nan    Nan
2       10065.0  (British Airways. )    London  Stockholm     24     43     87
3       10075.0       12. Air France  Budapest      Paris     13    Nan    Nan
4       10085.0          "Swiss Air"  Brussels     London     67     32    Nan